First_Routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "someone3"], ["email", "another_email@cookies.io"], ["created_at", "2019-01-28 23:38:41.117220"], ["updated_at", "2019-01-28 23:38:41.117220"]]
---
  def create
    user = User.new(params.require(:user).permit(:username))
    # replace the `user_attributes_here` with the actual attribute keys
    # user.save!
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "someone2"], ["updated_at", "2019-01-29 00:14:38.099070"], ["id", 3]]
---
  def update
    user = User.find(params[:id])

    if user.update(params.require(:user).permit(:username))